package org.example.chapter04;

   /*
            === 객체 지향 프로그래밍 ===
            : OOP (Object-Oriented Programming)
            : 현실 세계를 객체(Object)로 모델링하여
                , 객체 간의 상호작용으로 프로그램을 구성하는 방식

            1. 객체란?
            : 데이터(속성) + 기능(메서드)를 함께 묶은 단위
            >> 데이터와 데이터를 처리하는 방법을 포함하는 프로그래밍의 기본 단위

            [객체 예시]
            1) 커피 자판기
            - 데이터: 커피 종류, 사이즈, 가격, 재고, 물의 온도 등
            - 기능: 커피 제조, 재고 관리, 가격 설정 등

            2) 학교 관리 시스템
                학생 객체
                    - 데이터: 학생 이름, 학번, 수강 과목 등
                    - 기능: 성적 조회, 수강 신청 등
                교수 객체
                    - 데이터: 교수 이름, 연구 분야, 담당 과목 등
                    - 기능: 강의 계획서 업로드, 성적 입력 등
                수업 객체
                    - 데이터: 과목 명, 강의 시간, 강의실 등
                    - 기능: 출석 체크, 강의 자료 업로드 등

         */

public class A_Object {
    public static void main(String[] args) {



    }
}
